# pandas exercise

ใบงานแล็บนี้แสดง output ที่ถูกต้องไว้ เพื่อไม่ให้ output ดังกล่าวเปลี่ยนแปลงไป (จะได้เปรียบเทียบผลการทำงานได้) ให้นิสิต copy เซลล์ที่มี ... แล้วแก้ไขโค้ดในเซลล์ใหม่

อ่านไฟล์ username_password

In [19]:
import ...

In [20]:
df = ...
df.head(10)

   id         user_name          password
0   1    vance.jennings          joobheco
1   2    consuelo.eaton        0869347314
2   3   mitchel.perkins        fabypotter
3   4    odessa.vaughan         aharney88
4   5    araceli.wilder        acecdn3000
5   6  shawn.harrington           5278049
6   7        evelyn.gay            master
7   8       noreen.hale            murphy
8   9       gladys.ward           lwsves2
9  10   brant.zimmerman  1190KAREN5572497

In [21]:
df....

(982, 3)

# Length

เพิ่มคอลัมน์ `length` ที่เป็นความยาวของรหัสผ่าน

In [22]:
...
df.head()

   id        user_name    password  length
0   1   vance.jennings    joobheco       8
1   2   consuelo.eaton  0869347314      10
2   3  mitchel.perkins  fabypotter      10
3   4   odessa.vaughan   aharney88       9
4   5   araceli.wilder  acecdn3000      10

# Common Password

อ่านไฟล์ top_password

ผลการอ่านเป็น DataFrame ถ้าอยากให้เป็น Series มีสองวิธีคือ
1. เพิ่มพารามิเตอร์ squeeze=True
1. ใช้อินเด็กซ์ 0 เช่น common[0]

In [23]:
common = pd.read_csv(..., header=None)
common.head()

           0
0     123456
1   password
2   12345678
3     qwerty
4  123456789

เพิ่มคอลัมน์ common ใส่ df โดยมีค่า True ถ้าใช้รหัสผ่านจาก top_password

In [24]:
...
df.head()

   id        user_name    password  length  common
0   1   vance.jennings    joobheco       8   False
1   2   consuelo.eaton  0869347314      10   False
2   3  mitchel.perkins  fabypotter      10   False
3   4   odessa.vaughan   aharney88       9   False
4   5   araceli.wilder  acecdn3000      10   False

# นับจำนวน user ที่รหัสผ่านไม่ดี

รหัสผ่านที่ไม่ดีคือสั้นหรือใช้รหัสผ่านในไฟล์ top_password (สั้นหมายถึง < 8)

In [25]:
df['bad_password'] = (...) | (...)
df.bad_password.sum()

393

นับว่าเข้าเงื่อนไขรหัสผ่านที่ไม่ดีกี่ข้อ

In [26]:
def f(x):
    ...

df['criteria'] = df.apply(f, axis=1)
df['criteria'].value_counts()

0    589
1    281
2    112
Name: criteria, dtype: int64

# ยังไงต่อ

จากข้อมูลที่ได้ ควรจะทำโครงการ security awareness training หรือไม่? จะนำเสนออย่างไร?

# (optional) เพิ่มเงื่อนไขรหัสผ่านที่ไม่ดีคือมีชื่อหรือนามสกุลอยู่ในรหัสผ่าน